const resume = {
  name: "李明宇",
  tel: "13704683965",
  email: "mingyuli1997@gmail.com",
  age: "25 岁",
  seniority: 4,
  orientation: "高级开发工程师",
  info: [
    {
      type: "summary",
      title: "个人优势",
      contents: [
        "熟练掌握 HTML、CSS、JavaScript 以及前端常用工具。",
        "熟练使用 Vue.js ，了解其实现原理。",
        "了解前端工程化，熟悉 Webpack、Rollup、Babel 等常用配置。",
        "了解性能优化，能够运用到日常项目中。",
        "有良好的编码习惯，推动了部门的前端代码规范，编写了内部风格指南。",
        "具备跨端开发能力（PC 端、移动端、Hybrid 混合开发）。",
        "具备良好的团队协作精神，能利用自身技术能力提升团队整体研发效率。",
      ],
    },
    {
      type: "experience",
      title: "工作经历",
      list: [
        {
          title: "新浪网技术（中国）有限公司",
          duty: "前端开发工程师",
          dateScope: {
            start: "2020-10",
            end: "至今",
          },
          contents: [
            "推动前端基础建设升级，统一代码风格，编写开发规范，提高代码健壮性， 减小维护成本。",
            "封装常用的业务组件、⼯具方法等，减少重复代码，提⾼开发效率。",
            "High Five 项目核心开发，负责整体架构设计、任务分配及重难点模块开发。",
            "新浪新闻专题页（长期重点业务）核心开发，负责日常迭代和项目优化。",
            "负责新浪新闻 Hybrid 页和手机新浪网的开发及维护。",
            "多次在团队技术分享。",
          ],
        },
        {
          title: "哈工大机器人（义乌）人工智能研究院",
          duty: "前端开发工程师",
          dateScope: {
            start: "2019-03",
            end: "2020-10",
          },
          contents: [
            "参与软件组核心项目“智慧体育”的后台管理系统开发、维护。",
            "使用 C++ 完成“智慧体育”客户端开发，后期使用 Electron 重构。",
          ],
        },
      ],
    },
  ],
};
